CSI API ETABS v1
cGenDispl.GetPoint Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetPoint(
	string Name,
	ref int NumberItems,
	ref string[] PointName,
	ref double[] U1,
	ref double[] U2,
	ref double[] U3,
	ref double[] R1,
	ref double[] R2,
	ref double[] R3
)
Function GetPoint (
	Name As String,
	ByRef NumberItems As Integer,
	ByRef PointName As String(),
	ByRef U1 As Double(),
	ByRef U2 As Double(),
	ByRef U3 As Double(),
	ByRef R1 As Double(),
	ByRef R2 As Double(),
	ByRef R3 As Double()
) As Integer
Dim instance As cGenDispl
Dim Name As String
Dim NumberItems As Integer
Dim PointName As String()
Dim U1 As Double()
Dim U2 As Double()
Dim U3 As Double()
Dim R1 As Double()
Dim R2 As Double()
Dim R3 As Double()
Dim returnValue As Integer
returnValue = instance.GetPoint(Name,
	NumberItems, PointName, U1, U2, U3,
	R1, R2, R3)
int GetPoint(
	String^ Name,
	int% NumberItems,
	array<String^>^% PointName,
	array<double>^% U1,
	array<double>^% U2,
	array<double>^% U3,
	array<double>^% R1,
	array<double>^% R2,
	array<double>^% R3
)
abstract GetPoint :
        Name : string *
        NumberItems : int byref *
        PointName : string[] byref *
        U1 : float[] byref *
        U2 : float[] byref *
        U3 : float[] byref *
        R1 : float[] byref *
        R2 : float[] byref *
        R3 : float[] byref -> int
Parameters
Name
Type: System.String
NumberItems
Type: System.Int32
PointName
Type: System.String[]
U1
Type: System.Double[]
U2
Type: System.Double[]
U3
Type: System.Double[]
R1
Type: System.Double[]
R2
Type: System.Double[]
R3
Type: System.Double[]
Return Value
Type: Int32
See Also
Reference
cGenDispl Interface
ETABSv1 Namespace